//数据字典

//客户类型  个人客户、对公客户-酒店、对公客户-餐饮、对公客户-旅游、对公客户-其他
export const customerType = {
  1: '个人客户',
  2: '对公客户',
}

/* 基本信息 */
//性别
export const sexTypes = [
  {
    name: '男',
    value: '1'
  },
  {
    name: '女',
    value: '2'
  }
]

//是否
export const ifTypes = [
  {
    name: '否',
    value: 0
  },
  {
    name: '是',
    value: 1
  }
]


//是否
export const ifTypes2 = [
  {
    name: '否',
    value: '0'
  },
  {
    name: '是',
    value: '1'
  }
]
// 学历
export const ifTypes1 = {
  0: '否',
  1: '是',
}

// 学历
export const xl = {
  1: '博士生及以上',
  2: '研究生',
  3: '本科',
  4: '大专',
  5: '高中',
  6: '初中',
  7: '小学及以下',
}

// 婚姻状况
export const hyzk = {
  1: '未婚',
  2: '已婚',
  3: '丧偶',
  4: '离婚',
  5: '未说明',
}

// 民族
export const mz = {
  1: '汉',
  2: '其他少数民族',
}

// 政治面貌
export const zzmm = {
  1: '中共党员',
  2: '共青团员',
  3: '民族党派',
  4: '群众',
}

// 居住状况
export const jzzk = {
  1: '自置',
  2: '按揭',
  3: '亲属楼宇',
  4: '集体宿舍',
  5: '租房',
  6: '共有住宅',
  7: '其他',
  8: '未知',
}

// 其他人员，与该客户关系
export const gxType = {
  1: '配偶',
}

/* 加盟商信息 */
// 加盟类型
export const jmlx = {
  1: '新店',
  2: '存量',
}

// 所在城市得分
export const szcsdf = {
  1: '1',
  2: '2',
  3: '3',
  4: '4+',
}

// 商圈位置
export const sqwz = {
  1: '核心商圈',
  2: '成熟商圈',
  3: '发展中商圈',
  4: '潜力商圈',
}

// 地铁站距离
export const dtzjl = {
  1: '交通枢纽上盖',
  2: '500米',
  3: '1km内',
  4: '3km内',
  5: '无',
}

// 所属品牌公司
// export const ssppgsmc = {
//   1: '维也纳国际',
//   2: '郁锦香',
//   3: '康铂',
//   4: '凯里亚德',
//   5: '丽亭',
//   6: '丽柏',
//   7: '丽怡',
//   8: '欧暇',
//   9: '地中海',
//   10: '7天',
//   11: 'IU',
//   12: '派',
//   13: '丽简约开发BU',
//   14: '锦江都城',
//   15: '白玉兰品',
//   16: '锦江之星',
//   17: '维也纳',
//   18: '维也纳3好',
//   19: '维纳斯皇家',
//   20: '维也纳智好',
//   21: '好眠国际',
//   22: '丽枫',
//   23: '喆啡',
//   24: '希岸',
//   25: '欢朋',
//   26: 'Zmax&潮漫',
//   27: '非繁城品',
//   28: '其他',
// }

// 品牌发展阶段
export const ppfzjd = {
  '初创期': '初创期',
  '成长期': '成长期',
  '调整期': '调整期',
  '成熟期': '成熟期',
}

// 员工人数
export const ygrs = {
  1: '0-50',
  2: '51-100',
  3: '101-200',
  4: '201-300',
  5: '300-',
}

// 企业类型
export const qyType = {
  1: '中外合资',
  2: '中外合作',
  3: '外资',
  4: '国外投资股份有限公司',
  5: '其他国外投资',
  6: '国有全资',
  7: '集体全资',
  8: '股份合作',
  9: '联营',
  10: '有限责任公司',
  11: '股份有限公司',
  12: '私有',
  13: '其他内资',
  14: '内地和港澳台投资',
  15: '内地和港澳台合作',
  16: '港澳台独资',
  17: '港澳台投资股份有限公司',
  18: '其他港澳台投资',
  19: '其他',
}

// 国标行业分类
export const hyType = {
  1: '农、林、牧、渔业',
  2: '采矿业',
  3: '制造业',
  4: '电力、热力、燃气及水生产和供应业',
  5: '建筑业',
  6: '批发和零售业',
  7: '交通运输、仓储和邮政业',
  8: '住宿和餐饮业',
  9: '信息传输、软件和信息技术服务业',
  10: '金融业',
  11: '房地产业',
  12: '租赁和商务服务业',
  13: '科学研究和技术服务业',
  14: '水利、环境和公共设施管理业',
  15: '居民服务、修理和其他服务业',
  16: '教育',
  17: '卫生和社会工作',
  18: '文化、体育和娱乐业',
  19: '公共管理、社会保障和社会组织',
  20: '国际组织',
  21: '其他',
}

// 企业规模
export const qygm = {
  1: '大型',
  2: '中型',
  3: '小型',
  4: '微型',
}

// 上市公司类型
export const ssgslx = {
  1: 'A股上市',
  2: 'B股上市',
  3: 'H香港上市',
  4: 'F海外上市',
  5: '0非上市',
}

// 经营场地所有权
export const jycdsyq = {
  1: '自有',
  2: '租赁',
  // 3: '其他',
}

// 行业竞争状态
export const hyjzzt = {
  1: '激烈',
  2: '一般',
  3: '垄断',
}

// 融资策略
export const rzcl = {
  1: '计划性差、手段单一',
  2: '计划性强、手段单一',
  3: '计划性强、手段多激烈',
}

// 股东支持力度
export const gdzcld = {
  1: '强',
  2: '一般',
  3: '弱',
}

/* 征信信息 */
// 贷款账户状态
export const dkzhzt = {
  1: '正常',
  2: '关注',
  3: '次级',
  4: '可疑',
  5: '损失',
}

export const yqzt = {
  1: 'M0',
  2: 'M1',
  3: 'M2',
  4: 'M3',
  5: 'M4',
  6: 'M5',
  7: 'M6',
  8: 'M7',
  9: 'M8',
}

/* 预警管理 */
// 预警信号
export const yjxh = {
  1: '1-借款人提供虚假的财务报表或其他信息、资料或者财务不透明，财务数据真实性受质疑',
  2: '2-被银行业监管机构或其他金融机构列为信用不良客户',
  3: '3-采取违规、非法或其他弄虚作假等手段骗取银行贷款，或套取贷款用于谋取非法收入',
  4: '4-市场竞争力或市场份额出现较大幅度的下滑',
  5: '5-加盟酒店现金流低于公司要求比例回笼到集团账户',
  6: '6-企业经营停止，名存实亡',
  7: '7-已经或准备申请破产或清盘，以及正在破产清算等',
  8: '8-出现盲目的跨地区、跨行业、跨领域扩张',
  9: '9-汇率、税率等调整对企业生产经营造成较大负面影响',
  10: '10-遭遇重大的自然灾害或者不可抗力，对生产经营产生较大影响',
  11: '11-受到外部管理机关，例如工商、税务、司法、环保等机构的查处和大额处罚',
  12: '12-借款人涉及重大法律诉讼、仲裁或重大经济纠纷，导致损失严重的',
  13: '13-工程项目设计存在缺陷、自然条件恶劣、施工能力明显不足、并有可能影响施工进度和完工计划',
  14: '14-项目严重拖期或者严重超预算',
  15: '15-重大项目出现停建或者缓建情况',
  16: '16-借款人实际控制人、核心管理人员、董事会成员行为异常，或具有赌毒不良嗜好。',
  17: '17-借款人实际控制人、核心管理人员、董事会成员长时间无法联络、失踪、死亡或被拘审、“双规”或监视居留',
  18: '18-公司主要领导层、管理层不团结，出现严重分歧或分裂',
  19: '19-擅自实施改制、合并、分立、资产重组、租赁、承包、托管、出售等可能影响银行资产安全的行为',
  20: '20-不按贷款合同规定的贷款用途使用贷款，逃避监督，将贷款挪作不正当用途',
  21: '21-客户不愿意提供与信用审核有关的文件',
  22: '22-不遵守授信的承诺/不能按计划履行承诺',
  23: '23-还款来源没有落实',
  24: '24-接到许多其他银行对债务人的资信咨询调查',
  25: '25-突然出现大额资金向新交易商转移',
  26: '26-其他信用风险因素',
  27: '27-出售变卖主要的生产、经营性固定资产',
  28: '28-公司经常性拖欠工资、大规模裁员或大批人员离职、罢工、士气低落，引起社会关注',
  29: '29-公司与员工产生大规模的劳务纠纷',
  30: '30-公司主营业务不清，核心竞争力下降或丧失',
  31: '31-对部分客户和供应商过分依赖、依存度过高，导致采购及销售渠道单一、脆弱',
  32: '32-企业产品市场价格竞争力明显下降，销售市场占有率明显下降',
  33: '33-对企业具有重要影响的供应商和销售客户与其终止合作关系，或大幅减少合作量',
  34: '34-企业出现重大投资失误对企业经营造成较大影响',
  35: '35-注册资本未按规定到位',
  36: '36-发生法律纠纷，涉及诉讼标的金额较大，极有可能导致损失',
  37: '37-授信合同等文件存在法律性方面的问题',
  38: '38-贷款档案不齐全，重要文件遗失，对贷款偿还有实质性影响',
  39: '39-借款人实际控制人、核心管理人员、董事会成员、企业财务主管频繁变动',
  40: '40-借款人实际控制人、核心管理人员、董事会成员出现违法行为被处罚',
  41: '41-企业内部组织机构不合理，管理水平低，内部案件较多',
  42: '42-客户的竞争者、供货商或其他客户对授信客户产生负面评价',
  43: '43-对外提供大额的担保被索偿或大量资产被抵押，接近或超过自身的承受能力',
  44: '44-大额资金被关联方占用',
  45: '45-业务伙伴关系恶化',
  46: '46-集团内成员存在不正常的关联交易',
  47: '47-集团内成员交叉持股频繁',
  48: '48-集团客户存在异动资金流向',
  49: '49-在没有正当理由的情况下撤回或延迟提供与财务、业务、税收或抵押担保有关的信息或要求提供的其他文件',
  50: '50-客户不愿意提供过去的所得税纳税单',
  51: '51-有些债务未在资产负债表上反映或列示',
  52: '52-客户在银行的头寸不断减少',
  53: '53-对授信的长期占用',
  54: '54-对授信的需求增长异常',
  55: '55-对竞争变化或其他外部条件变化缺少对策',
  56: '56-核心盈利业务削弱和偏离',
  57: '57-管理层主要成员家庭出现问题',
  58: '58-管理层能力不足或构成缺乏代表性',
  59: '59-缺乏技术工人或有劳资争议',
  60: '60-工厂维护或设备管理落后',
  61: '61-缺乏操作控制、程序、质量控制等',
  62: '62-申请实施授信支付其他银行的债务，不交割抵押品，授信抵押品情况恶化',
  63: '63-授信需求增加，短期债务超常增加',
  64: '64-客户自身的配套资金不到位或不充足',
  65: '65-杠杆率过高，经常用短期债务支付长期债务',
  66: '66-客户申请无抵押授信产品或申请特殊还款方式',
  67: '67-成本和费用失控',
  68: '68-客户现金流出现严重问题',
  69: '69-欺诈，如在对方付款后故意不提供相应的产品或服务',
  70: '70-弄虚作假(如伪造或涂改各种批准文件或相关业务凭证)',
  71: '71-客户战略、业务或环境的重大变动',
  72: '72-某些欺诈信号，如无法证明财务记录的合法性',
  73: '73-对于信息的反应迟缓',
  74: '74-公司大规模裁员或大批人员离职，引起社会关注',
  75: '75-企业经营策略、经营计划发生了重大调整，致使公司原有的经营模式(如收入来源、主营业务)发生重大变化',
  76: '76-企业被吊销(或停止使用)贷款证、专营权、主导产品生产许可证等，或未参加工商年检或被有关职能机构查处',
  77: '77-对外提供新的大额担保或大量资产被抵押，接近或超过自身的承受能力',
  78: '78-主要代理经营权、特许经营权、供应商的丧失；产品严重积压，企业发生重大质量、生产事故，企业处于停产、半停产',
  79: '79-股票被ST或被证券管理机构发布不利的预警信息',
  80: '80-企业出售、变卖主要的生产、经营性固定资产',
  81: '81-不按贷款合同规定的贷款用途使用贷款，逃避监督，将贷款用于风险较大的项目，或用于不正当的用途，使得还款来源无法落实',
  82: '82-工程项目资金没有到位或被挪用',
  83: '83-偷逃税款',
  84: '84-贷款卡被人民银行吊销',
  85: '85-贷款卡状态暂停',
  86: '86-借款人非资金使用人，存在利用借款人套用贷款',
  87: '87-借款人账户因经济纠纷等被司法机构查封冻结',
  88: '88-遭遇全球性、持续性经济危机',
  89: '89-定期产生或处理对环境有潜在严重影响的有毒废料，对环境产生一定破坏',
  90: '90-抵御灾难能力较差，将给企业带来致命破坏',
  91: '91-借款人不能偿还对其他债权人的债务',
  92: '92-地方政府强制干预',
  93: '93-收入结构不合理、收入数量低决定借款人的还款能力较低或不稳定',
  94: '94-应收款项不能及时收回，逐年累加，账龄加长，坏账增加，导致现金流减少',
  95: '95-国家政策法规变化给当地经济带来不利影响',
  96: '96-其他',
}

/* 黑名单 */
// 黑名单类型
export const hmdType = {
  1: '1-银行核销客户名单',
  2: '2-银行存量不良客户名单',
  3: '3-逾期欠息60天以上非不良客户名单',
  4: '4-征信不良客户名单',
  5: '5-纳税非正常户名单',
  6: '6-被吊销营业执照客户名单',
  7: '7-法院被执行人名单',
  8: '8-失信老赖名单',
  9: '9-社会法人严重失信黑名单',
  10: '10-企业环保信用评级“红黑榜”',
  11: '11-欠款欠费名单',
  12: '12-企业在超过3（含）家金融机构有未结清授信',
  13: '13-征信逾期客户名单',
  14: '14-征信发生欠息客户名单',
  15: '15-征信发生垫款客户名单',
  16: '16-征信发生展期客户名单',
  17: '17-行政违法名单',
  18: '18-被（撤、吊）销许可证客户名单',
  19: '19-被（撤、吊）销资格证客户名单',
  20: '20-当前企业涉及小贷公司借贷名单',
  21: '21-海关失信企业名单',
  22: '22-其他',
}

/* 贷款办理 */
export const kxyt = {
  1: '酒店经营',
  2: '酒店改造',
  3: '新开酒店',
}


/**
 * 贷后状态
 * 0 新建
 * 1 已更新
 * 2 待更新
 */
export const reportStatus = {
  0: "待检查",
  1: '报告已更新',
  2: '报告待更新',
}

export const xcStatus = {
  0: '--',
  1: '待协查',
  2: '已协查',
}

export const zcfl = {
  1: '正常',
  2: '关注',
  3: '次级',
  4: '可疑',
  5: '损失',
}
// 资产分类流程状态
export const tzzcflStatus = {
  '-2': '已否决',
  '-1': '驳回',
  0: '—',
  1: '待审查',
  2: '待审批',
  3: '已通过',
}
// 资产分类流程步骤
export const zcfllcbz = {
  0: '发起人',
  1: '发起人',
  2: '审查人',
  3: '审批人',
  4: '其他',
}

// 责任属性
export const zrsx = {
  1: '主要责任',
  2: '次要责任',
}

// 责任类别
export const zrlb = {
  1: '不良资产形成责任',
  2: '保全管理责任',
}
// 资产保全流程状态
export const zcbqStatus = {
  '-2': '已否决',
  '-1': '驳回',
  0: '—',
  1: '待协查',
  2: '待审查',
  3: '待审批',
  4: '已通过',
}


/* 合作方管理 */
//业务品种
export const ywpz = {
  1: '个人贷款',
  2: '对公贷款',
  // 3: '经营贷',
}

// 业务币种
export const ywbz = {
  1: '人民币',
  2: '美元',
  3: '欧元',
  4: '英镑',
  5: '巴西雷亚尔',
  6: '日元',
  7: '加元',
  8: '港币',
  9: '澳元',
  10: '韩元',
  11: '其他',
}

//计息方式
export const jxfs = {
  1: '按月计息',
  2: '按季计息',
  3: '按半年结息',
  4: '按年计息',
  5: '利随本清',
  6: '预扣息',
}

//还款方式
export const hkfs = {
  1: '等额本息',
  2: '等额本金',
  3: '按还款计划还款',
  4: '分次付息一次还本',
}

//材料清单
export const clqd = {
  1: '营业执照',
  2: '法定代表人身份证',
  3: '特许行业经营许可证',
  4: '立项报告书',
}

//证件类型 
export const zjType = {
  1: '身份证',
  2: '护照',
  3: '港澳居民来往内地通行证',
  4: '台湾同胞来往内地通行证',
  5: '外国人居留证',
  6: '其他证件',
}
// 对公证件类型 营业执照,组织机构代码证,税务登记证,其他
export const dgzjlx = {
  1: '营业执照',
  2: '组织机构代码证',
  3: '税务登记证',
  4: '其他',
}
//预警 流程类型
export const warnStatus = {
  0: '驳回',
  1: '保存',
  2: '待协查',
  3: '待审查',
  4: '待审批',
  5: '已通过',
  6: '已通过',
  7: '已否决',
}

//预警级别：
export const yjjb = {
  1: '高',
  2: '中',
  3: '低',
}

//预警来源
export const yjxxly = {
  1: '贷后监控活动',
  2: '关注媒体',
  3: '研究分析',
  4: '金融监管机构披露',
  5: '其他',
}
//预警流程步骤
export const yjlcbz = {
  0: '发起人',
  1: '协查人',
  2: '审查人',
  3: '审批人',
  4: '其他',
}
//角色
export const roleTypes = {
  1: '品牌方客户经理',
  2: '财务公司客户经理',
  3: '财务公司审查岗',
  4: '财务公司有权审批',
  5: '财务公司后台管理',
  6: '管理员',
  7: '超级管理员',
}


//* 贷款订单状态-2 拒绝 -1驳回 0待提交申请 1待调查 2待审查 3待审批 4已完成申请
export const loanStatus = {
  '-2': '否决',
  '-1': '驳回',
  0: '待提交',
  1: '待调查',
  2: '待审查',
  3: '待审批',
  4: '已完成申请',

}
//贷款流程步骤
export const dklcbz = {
  0: '发起人',
  1: '调查人',
  2: '审查人',
  3: '审批人',
  4: '其他',
}

// 股东类型

export const gdType = [{
  name: '企业',
  value: 1
},
{
  name: '自然人',
  value: 2
}]
//借款人身份
export const jkrsfType = {
  1: '担保人',
  2: '共借人',
}
// 担保类型 保证、抵押、质押
export const dbType = {
  1: '保证',
  2: '抵押',
  3: '质押',
}
// 保证人【酒店企业、非酒店企业、自然人】
export const bzType = {
  1: '酒店企业',
  2: '非酒店企业',
  3: '自然人',
}

// 共借人【酒店企业、自然人】
export const gjrType = {
  1: '酒店企业',
  2: '自然人',
}
// 抵押物【房屋建筑物、土地使用权、机器设备、交通运输工具、其他】
export const dywType = {
  1: '房屋建筑物',
  2: '土地使用权',
  3: '机器设备',
  4: '交通运输工具',
  5: '其他',
}
// 质押物【保证金、存单、债券、股票股权、保险单、其他】  
export const zywType = {
  1: '保证金',
  2: '存单',
  3: '债券',
  4: '股票股权',
  5: '保险单',
  6: '其他',
}
